#+TITLE: Sylvia Comint
#+AUTHOR: Brandon Guttersohn

Interacting with a Sylvia instance through Emacs using comint. Based
on tutorial listed in the references section.

* Sylvia REPL Mode

#+BEGIN_SRC emacs-lisp
(defun sylvia--initialize ()
  "Helper function to initialize Sylvia"
  (setq comint-process-echoes t)
  (setq comint-use-prompt-regexp t))

(define-derived-mode sylvia-repl-mode comint-mode "Sylvia"
  "Major mode for `sylvia:run'.

\\<sylvia-mode-map>"
  nil "Sylvia"
  ;; this sets up the prompt so it matches things like: [foo@bar]
  (setq comint-prompt-regexp sylvia:prompt-regexp)
  ;; this makes it read only; a contentious subject as some prefer the
  ;; buffer to be overwritable.
  (setq comint-prompt-read-only t)
  ;; this makes it so commands like M-{ and M-} work.
  (set (make-local-variable 'paragraph-separate) "\\'")
  ;(set (make-local-variable 'font-lock-defaults) '(sylvia-font-lock-keywords t))
  (set (make-local-variable 'paragraph-start) sylvia:prompt-regexp))

;; this has to be done in a hook. grumble grumble.
(add-hook 'sylvia-mode-hook 'sylvia--initialize)
#+END_SRC

#+RESULTS:
| sylvia--initialize |

** Lookup

#+BEGIN_SRC emacs-lisp
(sylvia:lookup "cats")
#+END_SRC

#+RESULTS:
| K | AE | T | S |

#+BEGIN_SRC emacs-lisp
(sylvia:lookup "CaTs")
#+END_SRC

#+RESULTS:
| K | AE | T | S |

#+BEGIN_SRC emacs-lisp
(sylvia:lookup "tomato")
#+END_SRC

#+RESULTS:
| T | AH | M | EY | T | OW |
| T | AH | M | AA | T | OW |

#+BEGIN_SRC emacs-lisp
(length (sylvia:lookup "babaloo"))
#+END_SRC

#+RESULTS:
: 0


** Rhyme

#+BEGIN_SRC emacs-lisp
(sylvia:rhyme "saturday")
#+END_SRC

#+RESULTS:
| Saturdays | Dastardly | Saturday's |

#+BEGIN_SRC emacs-lisp
(sylvia:rhyme "saturday" 'perfect)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC emacs-lisp
(sylvia:rhyme "Ivanhoe" 'loose)
#+END_SRC

#+RESULTS:
| Idaho | Diagnosis | Microphone | Diagnosed | Microscope | Diagnose | Diagnosing | Isotope | Diagnoses | Microscopes | Isotopes | Cuyahoga | Dynamo | Kaleidoscope | Zydeco | Piezoelectric | Ayatollah | Styrofoam | Xylophone | Gyroscope | Amyotrophic | Byelorussia | Dialtone | Gyroscopes | Iacocca | Dinotopia | Iacono | Titleholder | Diantonio | Virazole | Ayatollah's | Iacocca's | Iacona | Cyclostome | Cyclostomes | Icenogle | Diaphonia | Stereomicroscope | Kayapo | Idaho's | Ivaco | Isentrope | Idaho-falls |

